ycsb_test_output/ycsb_output_mongodb_threads_vs_opssec_numthreads_1.txt
mongo connection created with mongodb://localhost:27017/ycsb
[OVERALL], RunTime(ms), 51512.0
[OVERALL], Throughput(ops/sec), 1941.2952321789098
[TOTAL_GCS_PS_Scavenge], Count, 10.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 26.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.050473676036651656
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 10.0
[TOTAL_GC_TIME], Time(ms), 26.0
[TOTAL_GC_TIME_%], Time(%), 0.050473676036651656
[READ], Operations, 49833.0
[READ], AverageLatency(us), 509.80472779082135
[READ], MinLatency(us), 379.0
[READ], MaxLatency(us), 12559.0
[READ], 95thPercentileLatency(us), 661.0
[READ], 99thPercentileLatency(us), 863.0
[READ], Return=OK, 49833
[CLEANUP], Operations, 1.0
[CLEANUP], AverageLatency(us), 1782.0
[CLEANUP], MinLatency(us), 1782.0
[CLEANUP], MaxLatency(us), 1782.0
[CLEANUP], 95thPercentileLatency(us), 1782.0
[CLEANUP], 99thPercentileLatency(us), 1782.0
[UPDATE], Operations, 50167.0
[UPDATE], AverageLatency(us), 510.7985727669584
[UPDATE], MinLatency(us), 366.0
[UPDATE], MaxLatency(us), 64127.0
[UPDATE], 95thPercentileLatency(us), 675.0
[UPDATE], 99thPercentileLatency(us), 878.0
[UPDATE], Return=OK, 50167