ycsb_test_output/ycsb_output_mongodb_threads_vs_opssec_numthreads_128.txt
mongo connection created with mongodb://localhost:27017/ycsb
[OVERALL], RunTime(ms), 25666.0
[OVERALL], Throughput(ops/sec), 3896.205096236266
[TOTAL_GCS_PS_Scavenge], Count, 15.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 70.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.2727343567365386
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 15.0
[TOTAL_GC_TIME], Time(ms), 70.0
[TOTAL_GC_TIME_%], Time(%), 0.2727343567365386
[READ], Operations, 50014.0
[READ], AverageLatency(us), 32670.21350021994
[READ], MinLatency(us), 684.0
[READ], MaxLatency(us), 131967.0
[READ], 95thPercentileLatency(us), 50687.0
[READ], 99thPercentileLatency(us), 69119.0
[READ], Return=OK, 50014
[CLEANUP], Operations, 128.0
[CLEANUP], AverageLatency(us), 12.21875
[CLEANUP], MinLatency(us), 0.0
[CLEANUP], MaxLatency(us), 1423.0
[CLEANUP], 95thPercentileLatency(us), 3.0
[CLEANUP], 99thPercentileLatency(us), 19.0
[UPDATE], Operations, 49986.0
[UPDATE], AverageLatency(us), 32621.68595206658
[UPDATE], MinLatency(us), 693.0
[UPDATE], MaxLatency(us), 139647.0
[UPDATE], 95thPercentileLatency(us), 50527.0
[UPDATE], 99thPercentileLatency(us), 68799.0
[UPDATE], Return=OK, 49986