ycsb_test_output/ycsb_output_mongodb_threads_vs_opssec_numthreads_16.txt
mongo connection created with mongodb://localhost:27017/ycsb
[OVERALL], RunTime(ms), 23593.0
[OVERALL], Throughput(ops/sec), 4238.545331242318
[TOTAL_GCS_PS_Scavenge], Count, 11.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 40.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.1695418132496927
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 11.0
[TOTAL_GC_TIME], Time(ms), 40.0
[TOTAL_GC_TIME_%], Time(%), 0.1695418132496927
[READ], Operations, 50087.0
[READ], AverageLatency(us), 3769.3559206979853
[READ], MinLatency(us), 505.0
[READ], MaxLatency(us), 84927.0
[READ], 95thPercentileLatency(us), 5855.0
[READ], 99thPercentileLatency(us), 10687.0
[READ], Return=OK, 50087
[CLEANUP], Operations, 16.0
[CLEANUP], AverageLatency(us), 84.1875
[CLEANUP], MinLatency(us), 1.0
[CLEANUP], MaxLatency(us), 1311.0
[CLEANUP], 95thPercentileLatency(us), 14.0
[CLEANUP], 99thPercentileLatency(us), 1311.0
[UPDATE], Operations, 49913.0
[UPDATE], AverageLatency(us), 3724.326448019554
[UPDATE], MinLatency(us), 485.0
[UPDATE], MaxLatency(us), 84863.0
[UPDATE], 95thPercentileLatency(us), 5799.0
[UPDATE], 99thPercentileLatency(us), 10599.0
[UPDATE], Return=OK, 49913