ycsb_test_output/ycsb_output_mongodb_threads_vs_opssec_numthreads_2.txt
mongo connection created with mongodb://localhost:27017/ycsb
[OVERALL], RunTime(ms), 40212.0
[OVERALL], Throughput(ops/sec), 2486.8198547697207
[TOTAL_GCS_PS_Scavenge], Count, 10.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 29.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.07211777578832189
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 10.0
[TOTAL_GC_TIME], Time(ms), 29.0
[TOTAL_GC_TIME_%], Time(%), 0.07211777578832189
[READ], Operations, 50315.0
[READ], AverageLatency(us), 794.8095796482162
[READ], MinLatency(us), 434.0
[READ], MaxLatency(us), 67455.0
[READ], 95thPercentileLatency(us), 1092.0
[READ], 99thPercentileLatency(us), 1566.0
[READ], Return=OK, 50315
[CLEANUP], Operations, 2.0
[CLEANUP], AverageLatency(us), 497.5
[CLEANUP], MinLatency(us), 10.0
[CLEANUP], MaxLatency(us), 985.0
[CLEANUP], 95thPercentileLatency(us), 985.0
[CLEANUP], 99thPercentileLatency(us), 985.0
[UPDATE], Operations, 49685.0
[UPDATE], AverageLatency(us), 800.0985810606822
[UPDATE], MinLatency(us), 409.0
[UPDATE], MaxLatency(us), 149119.0
[UPDATE], 95thPercentileLatency(us), 1104.0
[UPDATE], 99thPercentileLatency(us), 1574.0
[UPDATE], Return=OK, 49685