ycsb_test_output/ycsb_output_mongodb_threads_vs_opssec_numthreads_32.txt
mongo connection created with mongodb://localhost:27017/ycsb
[OVERALL], RunTime(ms), 23943.0
[OVERALL], Throughput(ops/sec), 4176.586058555737
[TOTAL_GCS_PS_Scavenge], Count, 11.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 42.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.17541661445934095
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 11.0
[TOTAL_GC_TIME], Time(ms), 42.0
[TOTAL_GC_TIME_%], Time(%), 0.17541661445934095
[READ], Operations, 50266.0
[READ], AverageLatency(us), 7657.306509370151
[READ], MinLatency(us), 550.0
[READ], MaxLatency(us), 86079.0
[READ], 95thPercentileLatency(us), 12703.0
[READ], 99thPercentileLatency(us), 19359.0
[READ], Return=OK, 50266
[CLEANUP], Operations, 32.0
[CLEANUP], AverageLatency(us), 42.125
[CLEANUP], MinLatency(us), 2.0
[CLEANUP], MaxLatency(us), 1244.0
[CLEANUP], 95thPercentileLatency(us), 4.0
[CLEANUP], 99thPercentileLatency(us), 1244.0
[UPDATE], Operations, 49734.0
[UPDATE], AverageLatency(us), 7572.790947842523
[UPDATE], MinLatency(us), 489.0
[UPDATE], MaxLatency(us), 86719.0
[UPDATE], 95thPercentileLatency(us), 12375.0
[UPDATE], 99thPercentileLatency(us), 18591.0
[UPDATE], Return=OK, 49734