ycsb_test_output/ycsb_output_mongodb_threads_vs_opssec_numthreads_4.txt
mongo connection created with mongodb://localhost:27017/ycsb
[OVERALL], RunTime(ms), 26444.0
[OVERALL], Throughput(ops/sec), 3781.5761609438814
[TOTAL_GCS_PS_Scavenge], Count, 10.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 29.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.10966570866737255
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 10.0
[TOTAL_GC_TIME], Time(ms), 29.0
[TOTAL_GC_TIME_%], Time(%), 0.10966570866737255
[READ], Operations, 50208.0
[READ], AverageLatency(us), 1063.0990877947738
[READ], MinLatency(us), 458.0
[READ], MaxLatency(us), 64959.0
[READ], 95thPercentileLatency(us), 1785.0
[READ], 99thPercentileLatency(us), 2959.0
[READ], Return=OK, 50208
[CLEANUP], Operations, 4.0
[CLEANUP], AverageLatency(us), 280.0
[CLEANUP], MinLatency(us), 2.0
[CLEANUP], MaxLatency(us), 1102.0
[CLEANUP], 95thPercentileLatency(us), 1102.0
[CLEANUP], 99thPercentileLatency(us), 1102.0
[UPDATE], Operations, 49792.0
[UPDATE], AverageLatency(us), 1036.586620340617
[UPDATE], MinLatency(us), 447.0
[UPDATE], MaxLatency(us), 78911.0
[UPDATE], 95thPercentileLatency(us), 1747.0
[UPDATE], 99thPercentileLatency(us), 2801.0
[UPDATE], Return=OK, 49792