ycsb_test_output/ycsb_output_mongodb_threads_vs_opssec_numthreads_64.txt
mongo connection created with mongodb://localhost:27017/ycsb
[OVERALL], RunTime(ms), 24203.0
[OVERALL], Throughput(ops/sec), 4131.7192083626
[TOTAL_GCS_PS_Scavenge], Count, 7.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 39.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.16113704912614138
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 7.0
[TOTAL_GC_TIME], Time(ms), 39.0
[TOTAL_GC_TIME_%], Time(%), 0.16113704912614138
[READ], Operations, 50004.0
[READ], AverageLatency(us), 15416.310175185985
[READ], MinLatency(us), 518.0
[READ], MaxLatency(us), 100543.0
[READ], 95thPercentileLatency(us), 23183.0
[READ], 99thPercentileLatency(us), 31903.0
[READ], Return=OK, 50004
[CLEANUP], Operations, 64.0
[CLEANUP], AverageLatency(us), 21.109375
[CLEANUP], MinLatency(us), 0.0
[CLEANUP], MaxLatency(us), 1244.0
[CLEANUP], 95thPercentileLatency(us), 8.0
[CLEANUP], 99thPercentileLatency(us), 34.0
[UPDATE], Operations, 49996.0
[UPDATE], AverageLatency(us), 15387.089247139771
[UPDATE], MinLatency(us), 585.0
[UPDATE], MaxLatency(us), 116799.0
[UPDATE], 95thPercentileLatency(us), 23327.0
[UPDATE], 99thPercentileLatency(us), 31823.0
[UPDATE], Return=OK, 49996