ycsb_test_output/ycsb_output_mongodb_threads_vs_opssec_numthreads_8.txt
mongo connection created with mongodb://localhost:27017/ycsb
[OVERALL], RunTime(ms), 23778.0
[OVERALL], Throughput(ops/sec), 4205.568172260072
[TOTAL_GCS_PS_Scavenge], Count, 10.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 36.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.1514004542013626
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 10.0
[TOTAL_GC_TIME], Time(ms), 36.0
[TOTAL_GC_TIME_%], Time(%), 0.1514004542013626
[READ], Operations, 50019.0
[READ], AverageLatency(us), 1915.2458265858972
[READ], MinLatency(us), 443.0
[READ], MaxLatency(us), 77311.0
[READ], 95thPercentileLatency(us), 3271.0
[READ], 99thPercentileLatency(us), 5499.0
[READ], Return=OK, 50019
[CLEANUP], Operations, 8.0
[CLEANUP], AverageLatency(us), 179.875
[CLEANUP], MinLatency(us), 2.0
[CLEANUP], MaxLatency(us), 1406.0
[CLEANUP], 95thPercentileLatency(us), 1406.0
[CLEANUP], 99thPercentileLatency(us), 1406.0
[UPDATE], Operations, 49981.0
[UPDATE], AverageLatency(us), 1859.381765070727
[UPDATE], MinLatency(us), 442.0
[UPDATE], MaxLatency(us), 76927.0
[UPDATE], 95thPercentileLatency(us), 3201.0
[UPDATE], 99thPercentileLatency(us), 5247.0
[UPDATE], Return=OK, 49981